package engine

var EastTable = map[rune]int{
	'ا': 1, 'ب': 2, 'ج': 3, 'د': 4, 'ه': 5, 'و': 6, 'ز': 7, 'ح': 8, 'ط': 9,
	'ي': 10, 'ك': 20, 'ل': 30, 'م': 40, 'ن': 50, 'س': 60, 'ع': 70, 'ف': 80,
	'ص': 90, 'ق': 100, 'ر': 200, 'ش': 300, 'ت': 400, 'ث': 500, 'خ': 600,
	'ذ': 700, 'ض': 800, 'ظ': 900, 'غ': 1000,
}

var WestTable = map[rune]int{
	'ا': 1, 'ب': 2, 'ج': 3, 'د': 4, 'ه': 5, 'و': 6, 'ز': 7, 'ح': 8, 'ط': 9,
	'ي': 10, 'ك': 20, 'ل': 30, 'م': 40, 'ن': 50, 'ص': 60, 'ع': 70, 'ف': 80,
	'ض': 90, 'ق': 100, 'ر': 200, 'س': 300, 'ت': 400, 'ث': 500, 'خ': 600,
	'ذ': 700, 'ظ': 800, 'غ': 900, 'ش': 1000,
}

var BastMapping = map[rune]string{
	'ا': "الف", 'ب': "با", 'ج': "جيم", 'د': "دال", 'ه': "ها", 'و': "واو", 'ز': "زا", 'ح': "حا", 'ط': "طا",
	'ي': "يا", 'ك': "كاف", 'ل': "لام", 'م': "ميم", 'ن': "نون", 'س': "سين", 'ع': "عين", 'ف': "فا", 'ص': "صاد",
	'ق': "قاف", 'ر': "را", 'ش': "شين", 'ت': "تا", 'ث': "ثا", 'خ': "خا", 'ذ': "ذال", 'ض': "ضاد", 'ظ': "ظا", 'غ': "غين",
}
